app/views/home/home.html.erb

 </div>
 par : <%=@users.select { |u| u.id == t.user_id }[0].first_name%>
---
SELECT "users".* FROM "users"