app/controllers/home_controller.rb

SELECT "potins".* FROM "potins"
SELECT "users".* FROM "users"
---
    def home
        @gossips = Potin.all
        @users = User.all

SELECT "potins".* FROM "potins" WHERE "potins"."id" = ?  [["id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
    def potin
        @potin = Potin.where(id: params[:index])[0]
        @user = User.where(id: @potin.user_id)[0]

SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def user
        @user = User.where(id: params[:index])[0]